"""
Треугольник Паскаля 1 🌶️
Треугольник Паскаля — бесконечная таблица биномиальных коэффициентов, имеющая треугольную форму. В этом треугольнике на вершине и по бокам стоят единицы. Каждое число равно сумме двух расположенных над ним чисел.

0:      1
1:     1 1
2:    1 2 1
3:   1 3 3 1
4:  1 4 6 4 1
      .....
На вход программе подается число nn. Напишите программу, которая возвращает указанную строку треугольника Паскаля в виде списка (нумерация строк начинается с нуля).

Формат входных данных
На вход программе подается число n \, (n \ge 0)n (n≥0).

Формат выходных данных
Программа должна вывести указанную строку треугольника Паскаля в виде списка.

Примечание 1. Решение удобно оформить в виде функции pascal(), которая принимает номер строки и возвращает соответствующую строку треугольника Паскаля.

Примечание 2. Графическая иллюстрация формирования треугольника Паскаля.



Примечание 3. Подробнее прочитать о треугольнике Паскаля можно тут.

Тестовые данные 🟢
Sample Input 1:

0
Sample Output 1:

[1]
Sample Input 2:

1
Sample Output 2:

[1, 1]
Sample Input 3:

2
Sample Output 3:

[1, 2, 1]
Sample Input 4:

3
Sample Output 4:

[1, 3, 3, 1]
"""
def pascal1(n):
    l = [[1]]
    if n == 0:
        return l[0]
    elif n >0:
        while (n+1)!=len(l):
            cl1 = 0
            cl2 = 1
            pr = [1]
            while len(pr)!=len(l[-1]):
                prn = l[-1][cl1]+l[-1][cl2]
                pr.append(prn)
                cl1 +=1
                cl2 +=1
            pr.append(1)
            l.append(pr)
        return l[n]

print(pascal1(int(input())))