"""
Подвиг 4. В программе вводятся два значения в одну строчку через пробел. Значениями могут быть числа, слова,
 булевы величины (True/False). Необходимо прочитать эти значения из входного потока. Если оба значения являются числами,
 то вычислить их сумму, иначе соединить их в одну строку с помощью оператора + (конкатенации строк). Результат вывести
 на экран (в блоке finally).

P.S. Реализовать программу с использованием блоков try/except/finally.

Sample Input:

8 11
Sample Output:

19
"""

try:
    x, y = input().split()
    print(int(x)+int(y))
except:
    try:
        print(float(x)+float(y))
    except:
        print(x+y)
